# Train file

## importing the libraries

In [224]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## creat a sries

In [225]:
a = [ "a" , "b" , "c"]
series = pd.Series( a , index =[0 , 1  , 2])
print(series)

0    a
1    b
2    c
dtype: object

## creat data frame

In [226]:
test_dataset = {
    'name' : ["Saleh" , "Pasha" , "Mehran"] ,
    'Age':[19 , 18 , 19] ,
    'Gender' : ["male" , "nmale " , "male"]
}
dataFrame = pd.DataFrame(test_dataset , index=['A' , 'B' , 'C'])
print(dataFrame)

     name  Age  Gender
A   Saleh   19    male
B   Pasha   18  nmale
C  Mehran   19    male

In [227]:
# show a specific row by loc (locate) .
print(dataFrame.loc[['A' , 'B']])
print("***************")
print(dataFrame.loc['A'])
# show the maximum number of rows that my system can showed
print("The maximum number of rows that can show is :" , pd.options.display.max_rows)
# change the maximum rows number : 
pd.options.display.max_rows = 90
print("The new maximum rows is : " , pd.options.display.max_rows)

    name  Age  Gender
A  Saleh   19    male
B  Pasha   18  nmale
***************
name      Saleh
Age          19
Gender     male
Name: A, dtype: object
The maximum number of rows that can show is : 90
The new maximum rows is :  90

In [228]:
# head and tail :
# by head we can see the head of elements in data frame
# by tail we can see the tail of data frame
print(dataFrame.head(5))
print("\n**********************\n")
print(dataFrame.tail(2))

# info method is the object of data frame that return some information about data frame
print("**********************")
print(dataFrame.info())

     name  Age  Gender
A   Saleh   19    male
B   Pasha   18  nmale
C  Mehran   19    male

**********************

     name  Age  Gender
B   Pasha   18  nmale
C  Mehran   19    male
**********************
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None

## read and print dataset

In [229]:
df = pd.read_csv('Data.csv')

features = df.iloc[ : , :  -1].values

target = df.iloc [ : , -1].values

In [230]:
# show the head of dataaset 
print("The head of dataset : \n\n")
print(df.head(5), "\n\n")
# print features and target of dataset
print("the features is : \n\n " , features , "\n\n")
print("The target is : \n\n  " , target)

The head of dataset :


   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes


the features is :

  [['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]


The target is :

   ['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

In [231]:
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

## Data cleaning

### how many missing value do we have?

In [232]:
mis_show = dataset.isnull().sum()
print(mis_show)
# how many total cells do we have?
cell_count = np.product(df.shape)
print(cell_count)
# how many missing values do we have?
mis_count = mis_show.sum()
print(mis_count)
# the percent of missing values : 
print(100 * mis_count/cell_count)

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64
40
2
5.0

### taking care of missing values

#### strategy 1

In [233]:
from sklearn.impute import SimpleImputer as simim
imputer = simim(missing_values = np.nan , strategy = "mean")
# imputer.fit(features[:, 1:3])
# features[:, 1:3] = imputer.transform(features[:, 1:3])
features[:, 1:3] = imputer.fit_transform(features[:, 1:3])
print(features)

[['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 63777.77777777778]
 ['France' 35.0 58000.0]
 ['Spain' 38.77777777777778 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]

#### strategy 2

##### dropna

In [234]:
# if we call the dropna : the nan rows is removing
print(df.dropna())
# df.dropna(inplace = True) --> this removing has be called by reference and the new df be replaced by previous
print("\n\n***********************")
# drop a specifics rows of the data frame by drop method
df.drop([0 , 1])

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes


***********************

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

##### fillna

##### fill wherever

In [235]:
# we can call the filna , to fill the nan cells by : 
# 1 _ a specific value
# 2_ mean , mode , median 
# (1)
print(df.fillna(22 , inplace = False))

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0     22.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  22.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [236]:
# (2)
mean = df['Age'].mean()
print("mean is :",  mean)
print(df.fillna(mean , inplace = False))
print("\n\n************************\n\n")

median = df['Age'].median()
print("the median is :" , median)
print(df.fillna(median , inplace = False))
print("\n\n************************\n\n")


mode = df['Age'].mode()[0] # the [0] means if we dont have mode , the minimum value of ages is place as mode . if we hade wrote[1] then , the second minimum value hade be placed as the mode .
print("The mode is : "  , mode)
print(df.fillna(mode , inplace = False))

mean is : 38.77777777777778
   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000     38.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes


************************


the median is : 38.0
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0     38.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes


************************


The mode is :  27.0
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0     27.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

##### fill the specific columns

In [239]:
mean = df['Salary'].mean()
print("The mean of the salaries is : " , mean)
print(df['Salary'].fillna(mean , inplace = False))

The mean of the salaries is :  63777.77777777778
0    72000.000000
1    48000.000000
2    54000.000000
3    61000.000000
4    63777.777778
5    58000.000000
6    52000.000000
7    79000.000000
8    83000.000000
9    67000.000000
Name: Salary, dtype: float64